# Pandas教程

### 2017七月在线 机器学习在线集训 julyedu.com
by 褚则伟

pandas是一个专门用于数据分析的python library

## [Pandas](http://pandas.pydata.org/)简介
- python数据分析library
- 基于numpy (对ndarray的操作)
- 有一种用python做Excel/SQL/R的感觉

## 目录
- Series
- DataFrame
- Index
- csv文件读写

## 数据结构Series

### 2017七月在线 机器学习在线集训 julyedu.com

In [1]:
import numpy as np
import pandas as pd

### 构造和初始化Series

In [5]:
s = pd.Series([7, "Beijing", 2.17, -12345, "Happy"])

In [15]:
s[1]

'Beijing'

Series是一个一维的数据结构，下面是一些初始化Series的方法。

In [16]:
s = pd.Series([7, "Beijing", 2.17, -12345, "Happy"])
s

0          7
1    Beijing
2       2.17
3     -12345
4      Happy
dtype: object

pandas会默认用0到n来作为Series的index，但是我们也可以自己指定index。index我们可以把它理解为dict里面的key。

In [17]:
s = pd.Series([7, "Beijing", 2.17, -12345, "Happy"], index=["A", "B", "C", "D", "E"])
s

A          7
B    Beijing
C       2.17
D     -12345
E      Happy
dtype: object

还可以用dictionary来构造一个Series，因为Series本来就是key value pairs。

In [19]:
cities = {"Beijing": 55000, "Shanghai": 60000, "Shenzhen": 50000, "Hangzhou": 20000, "Guangzhou": 20000, "Suzhou": None}
apts = pd.Series(cities, name="price")
apts

Beijing      55000.0
Guangzhou    20000.0
Hangzhou     20000.0
Shanghai     60000.0
Shenzhen     50000.0
Suzhou           NaN
dtype: float64

In [20]:
cities = {"Beijing": 55000, "Shanghai": 60000, "Shenzhen": 50000, "Hangzhou": 20000, "Guangzhou": 20000, "Suzhou": None}
apts = pd.Series(cities, name="price")
apts

Beijing      55000.0
Guangzhou    20000.0
Hangzhou     20000.0
Shanghai     60000.0
Shenzhen     50000.0
Suzhou           NaN
Name: price, dtype: float64

numpy ndarray构建一个Series

In [21]:
s = pd.Series(np.random.randn(5), index=['a', 'b', 'c', 'd', 'e'])
s

a    0.590158
b    0.880828
c   -0.251413
d   -1.447042
e    1.318019
dtype: float64

### 选择数据

我们可以像对待一个list一样对待Series

In [22]:
apts

Beijing      55000.0
Guangzhou    20000.0
Hangzhou     20000.0
Shanghai     60000.0
Shenzhen     50000.0
Suzhou           NaN
Name: price, dtype: float64

In [23]:
apts[3]

60000.0

In [24]:
apts[[3,4,1]]

Shanghai     60000.0
Shenzhen     50000.0
Guangzhou    20000.0
Name: price, dtype: float64

In [25]:
apts[1:]

Guangzhou    20000.0
Hangzhou     20000.0
Shanghai     60000.0
Shenzhen     50000.0
Suzhou           NaN
Name: price, dtype: float64

In [26]:
apts[:-1]

Beijing      55000.0
Guangzhou    20000.0
Hangzhou     20000.0
Shanghai     60000.0
Shenzhen     50000.0
Name: price, dtype: float64

为什么下面这样会拿到两个NaN呢？

In [27]:
apts[1:] + apts[:-1]

Beijing           NaN
Guangzhou     40000.0
Hangzhou      40000.0
Shanghai     120000.0
Shenzhen     100000.0
Suzhou            NaN
Name: price, dtype: float64

Series就像一个dict，前面定义的index就是用来选择数据的

In [28]:
apts["Hangzhou"]

20000.0

In [29]:
apts[["Hangzhou", "Beijing", "Shenzhen"]]

Hangzhou    20000.0
Beijing     55000.0
Shenzhen    50000.0
Name: price, dtype: float64

In [30]:
"Hangzhou" in apts

True

In [31]:
"Chongqing" in apts

False

In [2]:
# apts["Chongqing"]

In [34]:
print(apts.get("Chongqing"))

None

In [35]:
print(apts.get("Shenzhen"))

50000.0

boolean indexing，与numpy类似。

In [36]:
apts[apts < 50000]

Guangzhou    20000.0
Hangzhou     20000.0
Name: price, dtype: float64

In [37]:
apts.median()

50000.0

In [38]:
apts.mean()

41000.0

In [39]:
apts.min()

20000.0

In [40]:
apts.max()

60000.0

下面我再详细展示一下这个boolean indexing是如何工作的

In [42]:
less_than_50000 = apts < 50000

In [45]:
less_than_50000

Beijing      False
Guangzhou     True
Hangzhou      True
Shanghai     False
Shenzhen     False
Suzhou       False
Name: price, dtype: bool

In [46]:
apts[less_than_50000]

Guangzhou    20000.0
Hangzhou     20000.0
Name: price, dtype: float64

In [47]:
apts[ apts > apts.mean() ]

Beijing     55000.0
Shanghai    60000.0
Shenzhen    50000.0
Name: price, dtype: float64

### Series元素赋值

Series的元素可以被赋值

In [49]:
print("Old price of Shenzhen: {}".format(apts["Shenzhen"]))
apts["Shenzhen"] = 70000
print("New price of Shenzhen: {}".format(apts["Shenzhen"]))

Old price of Shenzhen: 50000.0
New price of Shenzhen: 70000.0

In [50]:
apts

Beijing      55000.0
Guangzhou    20000.0
Hangzhou     20000.0
Shanghai     60000.0
Shenzhen     70000.0
Suzhou           NaN
Name: price, dtype: float64

前面讲过的boolean indexing在赋值的时候也可以用

In [51]:
apts[apts < 50000] = 40000

In [52]:
apts

Beijing      55000.0
Guangzhou    40000.0
Hangzhou     40000.0
Shanghai     60000.0
Shenzhen     70000.0
Suzhou           NaN
Name: price, dtype: float64

### 数学运算

下面我们来讲一些基本的数学运算。

In [53]:
apts / 2

Beijing      27500.0
Guangzhou    20000.0
Hangzhou     20000.0
Shanghai     30000.0
Shenzhen     35000.0
Suzhou           NaN
Name: price, dtype: float64

In [54]:
apts ** 2

Beijing      3.025000e+09
Guangzhou    1.600000e+09
Hangzhou     1.600000e+09
Shanghai     3.600000e+09
Shenzhen     4.900000e+09
Suzhou                NaN
Name: price, dtype: float64

numpy的运算可以被运用到pandsa上去

In [57]:
np.log(apts)

Beijing      10.915088
Guangzhou    10.596635
Hangzhou     10.596635
Shanghai     11.002100
Shenzhen     11.156251
Suzhou             NaN
Name: price, dtype: float64

我们再定义一个新的Series做加法

In [59]:
cars = pd.Series({"Beijing": 300000, "Shanghai": 350000, "Shenzhen": 300000, \
                  "Tianjin": 200000, "Guangzhou": 200000, "Chongqing": 150000})

In [60]:
cars

Beijing      300000
Chongqing    150000
Guangzhou    200000
Shanghai     350000
Shenzhen     300000
Tianjin      200000
dtype: int64

In [66]:
expense = cars + apts * 100

### 数据缺失

[reference](https://pandas.pydata.org/pandas-docs/stable/missing_data.html)

In [62]:
"Hangzhou" in apts

True

In [63]:
"Hangzhou" in cars

False

In [64]:
apts.notnull()

Beijing       True
Guangzhou     True
Hangzhou      True
Shanghai      True
Shenzhen      True
Suzhou       False
Name: price, dtype: bool

In [65]:
apts.isnull()

Beijing      False
Guangzhou    False
Hangzhou     False
Shanghai     False
Shenzhen     False
Suzhou        True
Name: price, dtype: bool

In [73]:
expense[expense.isnull()] = expense.mean()

In [74]:
expense

Beijing      5800000.0
Chongqing    5912500.0
Guangzhou    4200000.0
Hangzhou     5912500.0
Shanghai     6350000.0
Shenzhen     7300000.0
Suzhou       5912500.0
Tianjin      5912500.0
dtype: float64

## 数据结构[Dataframe](http://pandas.pydata.org/pandas-docs/stable/generated/pandas.DataFrame.html)

### 2017七月在线 机器学习在线集训 julyedu.com

一个Dataframe就是一张表格，Series表示的是一维数组，Dataframe则是一个二维数组，可以类比成一张excel的spreadsheet。也可以把Dataframe当做一组Series的集合。

### 创建一个DataFrame

dataframe可以由一个dictionary构造得到。

In [75]:
data = {"City": ["Beijing", "Shanghai", "Guangzhou", "Shenzhen", "Hangzhou", "Chongqing"],
       "year": [2016,  2017, 2016, 2017, 2016, 2016],
       "population": [2100, 2300, 1000, 700, 500, 500]}
pd.DataFrame(data)

        City  population  year
0    Beijing        2100  2016
1   Shanghai        2300  2017
2  Guangzhou        1000  2016
3   Shenzhen         700  2017
4   Hangzhou         500  2016
5  Chongqing         500  2016

columns的名字和顺序可以指定

In [77]:
pd.DataFrame(data, columns = ["year", "City", "population"])

   year       City  population
0  2016    Beijing        2100
1  2017   Shanghai        2300
2  2016  Guangzhou        1000
3  2017   Shenzhen         700
4  2016   Hangzhou         500
5  2016  Chongqing         500

In [79]:
pd.DataFrame(data, columns = ["year", "City", "population"], \
            index=["one", "two", "three", "four", "five", "six"])

       year       City  population
one    2016    Beijing        2100
two    2017   Shanghai        2300
three  2016  Guangzhou        1000
four   2017   Shenzhen         700
five   2016   Hangzhou         500
six    2016  Chongqing         500

也可以从几个Series构建一个DataFrame

In [81]:
apts

Beijing      55000.0
Guangzhou    40000.0
Hangzhou     40000.0
Shanghai     60000.0
Shenzhen     70000.0
Suzhou           NaN
Name: price, dtype: float64

In [82]:
cars

Beijing      300000
Chongqing    150000
Guangzhou    200000
Shanghai     350000
Shenzhen     300000
Tianjin      200000
dtype: int64

In [83]:
df = pd.DataFrame({"apts": apts, "cars": cars})
df

              apts      cars
Beijing    55000.0  300000.0
Chongqing      NaN  150000.0
Guangzhou  40000.0  200000.0
Hangzhou   40000.0       NaN
Shanghai   60000.0  350000.0
Shenzhen   70000.0  300000.0
Suzhou         NaN       NaN
Tianjin        NaN  200000.0

也可以用一个list of dicts来构建DataFrame

In [84]:
data = [{"July": 999999, "Han": 50000, "Zewei": 1000}, {"July": 99999, "Han": 8000, "Zewei": 200}]
pd.DataFrame(data)

     Han    July  Zewei
0  50000  999999   1000
1   8000   99999    200

In [85]:
pd.DataFrame(data, index=["salary", "bonus"])

          Han    July  Zewei
salary  50000  999999   1000
bonus    8000   99999    200

## 练习

- 构建三个Series，分别是一系列商品的单价，计量单位，和数量。至于是什么商品什么计量单位由大家自己决定。
- 然后把这三个Series合并成一个DataFrame。

In [2]:
import pandas as pd
price = pd.Series([20, 2, 4, 50, 40], 
                 index = ["Apple", "Banana", "Orange", "Watermelon", "Strawberry"])
unit = pd.Series(["kg", "each", "each", "each", "kg"], 
                index = ["Apple", "Banana", "Orange", "Watermelon", "Strawberry"])
amount = pd.Series([5, 10, 6, 1, 2], 
                index = ["Apple", "Banana", "Orange", "Watermelon", "Strawberry"])

In [7]:
fruit_df = pd.DataFrame({"price": price, "unit": unit, "amount": amount}, columns = ["price", "unit", "amount"])
fruit_df

            price  unit  amount
Apple          20    kg       5
Banana          2  each      10
Orange          4  each       6
Watermelon     50  each       1
Strawberry     40    kg       2

### 2017七月在线 机器学习在线集训 julyedu.com

## 数据结构DataFrame

In [1]:
import pandas as pd
cities = {'Beijing': 55000, 'Shanghai': 60000, 'Shenzhen': 50000, 'Hangzhou': 20000, 'Guangzhou': 25000, 'Suzhou': None}
# apts = pd.Series(cities)
apts = pd.Series(cities, name="price")
apts

Beijing      55000.0
Guangzhou    25000.0
Hangzhou     20000.0
Shanghai     60000.0
Shenzhen     50000.0
Suzhou           NaN
Name: price, dtype: float64

In [2]:
cars = pd.Series({'Beijing': 300000, 'Shanghai': 400000, 'Shenzhen': 300000, \
                      'Tianjin': 200000, 'Guangzhou': 200000, 'Chongqing': 150000}, name="cars")
cars

Beijing      300000
Chongqing    150000
Guangzhou    200000
Shanghai     400000
Shenzhen     300000
Tianjin      200000
Name: cars, dtype: int64

In [3]:
df = pd.DataFrame({"apts": apts, "cars": cars})
df

              apts      cars
Beijing    55000.0  300000.0
Chongqing      NaN  150000.0
Guangzhou  25000.0  200000.0
Hangzhou   20000.0       NaN
Shanghai   60000.0  400000.0
Shenzhen   50000.0  300000.0
Suzhou         NaN       NaN
Tianjin        NaN  200000.0

In [11]:
print(df["cars"])
print(type(df["cars"]))

Beijing      300000.0
Chongqing    150000.0
Guangzhou    200000.0
Hangzhou          NaN
Shanghai     400000.0
Shenzhen     300000.0
Suzhou            NaN
Tianjin      200000.0
Name: cars, dtype: float64
<class 'pandas.core.series.Series'>

加入一个新的column,默认会broadcast

In [7]:
df["income"] = 20000

In [8]:
df

              apts      cars  income
Beijing    55000.0  300000.0   20000
Chongqing      NaN  150000.0   20000
Guangzhou  25000.0  200000.0   20000
Hangzhou   20000.0       NaN   20000
Shanghai   60000.0  400000.0   20000
Shenzhen   50000.0  300000.0   20000
Suzhou         NaN       NaN   20000
Tianjin        NaN  200000.0   20000

In [5]:
df["expense"] = df["apts"] * 100 + df["cars"]

In [13]:
df

              apts      cars  income    expense
Beijing    55000.0  300000.0   20000  5800000.0
Chongqing      NaN  150000.0   20000        NaN
Guangzhou  25000.0  200000.0   20000  2700000.0
Hangzhou   20000.0       NaN   20000        NaN
Shanghai   60000.0  400000.0   20000  6400000.0
Shenzhen   50000.0  300000.0   20000  5300000.0
Suzhou         NaN       NaN   20000        NaN
Tianjin        NaN  200000.0   20000        NaN

DataFrame的行由index决定

In [14]:
df.index

Index(['Beijing', 'Chongqing', 'Guangzhou', 'Hangzhou', 'Shanghai', 'Shenzhen',
       'Suzhou', 'Tianjin'],
      dtype='object')

DataFrame的列由column names决定

In [18]:
print(df["apts"])

Beijing      55000.0
Chongqing        NaN
Guangzhou    25000.0
Hangzhou     20000.0
Shanghai     60000.0
Shenzhen     50000.0
Suzhou           NaN
Tianjin          NaN
Name: apts, dtype: float64

loc方法可以用index选中行

In [15]:
df.loc["Beijing"]

apts         55000.0
cars        300000.0
income       20000.0
expense    5800000.0
Name: Beijing, dtype: float64

In [21]:
df.loc[["Shanghai", "Hangzhou", "Suzhou"]]

             apts      cars  income    expense
Shanghai  60000.0  400000.0   20000  6400000.0
Hangzhou  20000.0       NaN   20000        NaN
Suzhou        NaN       NaN   20000        NaN

In [22]:
df.loc["Hangzhou":"Suzhou"]

             apts      cars  income    expense
Hangzhou  20000.0       NaN   20000        NaN
Shanghai  60000.0  400000.0   20000  6400000.0
Shenzhen  50000.0  300000.0   20000  5300000.0
Suzhou        NaN       NaN   20000        NaN

下面这种方法默认用来选列而不是选行

In [17]:
# df["Beijing"]

iloc方法可以用数字选中行

In [28]:
df.iloc[0:5]

              apts      cars  income    expense
Beijing    55000.0  300000.0   20000  5800000.0
Chongqing      NaN  150000.0   20000        NaN
Guangzhou  25000.0  200000.0   20000  2700000.0
Hangzhou   20000.0       NaN   20000        NaN
Shanghai   60000.0  400000.0   20000  6400000.0

行列一起选

In [31]:
df[["apts", "income"]].loc["Chongqing":"Shanghai"]

              apts  income
Chongqing      NaN   20000
Guangzhou  25000.0   20000
Hangzhou   20000.0   20000
Shanghai   60000.0   20000

In [32]:
df.ix[1:4, 1:3]

/Users/zeweichu/anaconda3/envs/py36/lib/python3.6/site-packages/ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

               cars  income
Chongqing  150000.0   20000
Guangzhou  200000.0   20000
Hangzhou        NaN   20000

### DataFrame元素赋值

In [35]:
df["income"].loc["Beijing"] = 30000

/Users/zeweichu/anaconda3/envs/py36/lib/python3.6/site-packages/pandas/core/indexing.py:179: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  self._setitem_with_indexer(indexer, value)

In [36]:
df

              apts      cars  income    expense
Beijing    55000.0  300000.0   30000  5800000.0
Chongqing      NaN  150000.0   20000        NaN
Guangzhou  25000.0  200000.0   20000  2700000.0
Hangzhou   20000.0       NaN   20000        NaN
Shanghai   60000.0  400000.0   20000  6400000.0
Shenzhen   50000.0  300000.0   20000  5300000.0
Suzhou         NaN       NaN   20000        NaN
Tianjin        NaN  200000.0   20000        NaN

可以给一整列赋值

In [4]:
df["income"] = 15000

In [38]:
df

              apts      cars  income    expense
Beijing    55000.0  300000.0   15000  5800000.0
Chongqing      NaN  150000.0   15000        NaN
Guangzhou  25000.0  200000.0   15000  2700000.0
Hangzhou   20000.0       NaN   15000        NaN
Shanghai   60000.0  400000.0   15000  6400000.0
Shenzhen   50000.0  300000.0   15000  5300000.0
Suzhou         NaN       NaN   15000        NaN
Tianjin        NaN  200000.0   15000        NaN

给一整行赋值

In [39]:
df.loc["Suzhou"] = 0
df

              apts      cars  income    expense
Beijing    55000.0  300000.0   15000  5800000.0
Chongqing      NaN  150000.0   15000        NaN
Guangzhou  25000.0  200000.0   15000  2700000.0
Hangzhou   20000.0       NaN   15000        NaN
Shanghai   60000.0  400000.0   15000  6400000.0
Shenzhen   50000.0  300000.0   15000  5300000.0
Suzhou         0.0       0.0       0        0.0
Tianjin        NaN  200000.0   15000        NaN

In [43]:
import numpy as np
df.income = np.arange(8)*10000

In [44]:
df

              apts      cars  income    expense
Beijing    55000.0  300000.0       0  5800000.0
Chongqing      NaN  150000.0   10000        NaN
Guangzhou  25000.0  200000.0   20000  2700000.0
Hangzhou   20000.0       NaN   30000        NaN
Shanghai   60000.0  400000.0   40000  6400000.0
Shenzhen   50000.0  300000.0   50000  5300000.0
Suzhou         0.0       0.0   60000        0.0
Tianjin        NaN  200000.0   70000        NaN

In [45]:
df.shape

(8, 4)

In [47]:
df.shape[1]

4

还可以用Series来指定需要修改的index以及相对应的value，没有指定的默认用NaN.

In [48]:
income = pd.Series([10000, 20000, 30000], index=["Chongqing", "Guangzhou", "Shenzhen"])
df.income = income
df

              apts      cars   income    expense
Beijing    55000.0  300000.0      NaN  5800000.0
Chongqing      NaN  150000.0  10000.0        NaN
Guangzhou  25000.0  200000.0  20000.0  2700000.0
Hangzhou   20000.0       NaN      NaN        NaN
Shanghai   60000.0  400000.0      NaN  6400000.0
Shenzhen   50000.0  300000.0  30000.0  5300000.0
Suzhou         0.0       0.0      NaN        0.0
Tianjin        NaN  200000.0      NaN        NaN

In [50]:
df["western"] = df.index == "Chongqing"

In [51]:
df

              apts      cars   income    expense  western
Beijing    55000.0  300000.0      NaN  5800000.0    False
Chongqing      NaN  150000.0  10000.0        NaN     True
Guangzhou  25000.0  200000.0  20000.0  2700000.0    False
Hangzhou   20000.0       NaN      NaN        NaN    False
Shanghai   60000.0  400000.0      NaN  6400000.0    False
Shenzhen   50000.0  300000.0  30000.0  5300000.0    False
Suzhou         0.0       0.0      NaN        0.0    False
Tianjin        NaN  200000.0      NaN        NaN    False

In [52]:
df.columns

Index(['apts', 'cars', 'income', 'expense', 'western'], dtype='object')

In [53]:
df.index

Index(['Beijing', 'Chongqing', 'Guangzhou', 'Hangzhou', 'Shanghai', 'Shenzhen',
       'Suzhou', 'Tianjin'],
      dtype='object')

一个DataFrame就和一个numpy 2d array一样，可以被转置

In [54]:
df.T

         Beijing Chongqing Guangzhou Hangzhou Shanghai Shenzhen Suzhou Tianjin
apts       55000       NaN     25000    20000    60000    50000      0     NaN
cars      300000    150000    200000      NaN   400000   300000      0  200000
income       NaN     10000     20000      NaN      NaN    30000    NaN     NaN
expense  5.8e+06       NaN   2.7e+06      NaN  6.4e+06  5.3e+06      0     NaN
western    False      True     False    False    False    False  False   False

用info查看DataFrame的信息

In [55]:
df.info

<bound method DataFrame.info of               apts      cars   income    expense  western
Beijing    55000.0  300000.0      NaN  5800000.0    False
Chongqing      NaN  150000.0  10000.0        NaN     True
Guangzhou  25000.0  200000.0  20000.0  2700000.0    False
Hangzhou   20000.0       NaN      NaN        NaN    False
Shanghai   60000.0  400000.0      NaN  6400000.0    False
Shenzhen   50000.0  300000.0  30000.0  5300000.0    False
Suzhou         0.0       0.0      NaN        0.0    False
Tianjin        NaN  200000.0      NaN        NaN    False>

我们还可以指定index的名字和列的名字

In [58]:
df.index.name = "city"
df.columns.name = "info"
df

info          apts      cars   income    expense  western
city
Beijing    55000.0  300000.0      NaN  5800000.0    False
Chongqing      NaN  150000.0  10000.0        NaN     True
Guangzhou  25000.0  200000.0  20000.0  2700000.0    False
Hangzhou   20000.0       NaN      NaN        NaN    False
Shanghai   60000.0  400000.0      NaN  6400000.0    False
Shenzhen   50000.0  300000.0  30000.0  5300000.0    False
Suzhou         0.0       0.0      NaN        0.0    False
Tianjin        NaN  200000.0      NaN        NaN    False

In [59]:
df.T

city     Beijing Chongqing Guangzhou Hangzhou Shanghai Shenzhen Suzhou Tianjin
info
apts       55000       NaN     25000    20000    60000    50000      0     NaN
cars      300000    150000    200000      NaN   400000   300000      0  200000
income       NaN     10000     20000      NaN      NaN    30000    NaN     NaN
expense  5.8e+06       NaN   2.7e+06      NaN  6.4e+06  5.3e+06      0     NaN
western    False      True     False    False    False    False  False   False

## 课后作业
- 研究一下pandas当中的broadcast是怎么用的，对比一下numpy中的broadcast

In [7]:
df

              apts      cars  income    expense
Beijing    55000.0  300000.0   15000  5800000.0
Chongqing      NaN  150000.0   15000        NaN
Guangzhou  25000.0  200000.0   15000  2700000.0
Hangzhou   20000.0       NaN   15000        NaN
Shanghai   60000.0  400000.0   15000  6400000.0
Shenzhen   50000.0  300000.0   15000  5300000.0
Suzhou         NaN       NaN   15000        NaN
Tianjin        NaN  200000.0   15000        NaN

In [12]:
df.loc["Chongqing":"Hangzhou", ["apts", "income"]]

              apts  income
Chongqing      NaN   15000
Guangzhou  25000.0   15000
Hangzhou   20000.0   15000

In [14]:
df[2:5]

              apts      cars  income    expense
Guangzhou  25000.0  200000.0   15000  2700000.0
Hangzhou   20000.0       NaN   15000        NaN
Shanghai   60000.0  400000.0   15000  6400000.0

In [15]:
df["cars"].isin([300000, 200000])

Beijing       True
Chongqing    False
Guangzhou     True
Hangzhou     False
Shanghai     False
Shenzhen      True
Suzhou       False
Tianjin       True
Name: cars, dtype: bool

In [16]:
df.isin([300000, 200000])

            apts   cars  income  expense
Beijing    False   True   False    False
Chongqing  False  False   False    False
Guangzhou  False   True   False    False
Hangzhou   False  False   False    False
Shanghai   False  False   False    False
Shenzhen   False   True   False    False
Suzhou     False  False   False    False
Tianjin    False   True   False    False

In [17]:
df == 300000

            apts   cars  income  expense
Beijing    False   True   False    False
Chongqing  False  False   False    False
Guangzhou  False  False   False    False
Hangzhou   False  False   False    False
Shanghai   False  False   False    False
Shenzhen   False   True   False    False
Suzhou     False  False   False    False
Tianjin    False  False   False    False

In [21]:
df.where(df["apts"] > 50000)

              apts      cars   income    expense
Beijing    55000.0  300000.0  15000.0  5800000.0
Chongqing      NaN       NaN      NaN        NaN
Guangzhou      NaN       NaN      NaN        NaN
Hangzhou       NaN       NaN      NaN        NaN
Shanghai   60000.0  400000.0  15000.0  6400000.0
Shenzhen       NaN       NaN      NaN        NaN
Suzhou         NaN       NaN      NaN        NaN
Tianjin        NaN       NaN      NaN        NaN

In [19]:
df["apts"] > 50000

Beijing       True
Chongqing    False
Guangzhou    False
Hangzhou     False
Shanghai      True
Shenzhen     False
Suzhou       False
Tianjin      False
Name: apts, dtype: bool

In [22]:
df

              apts      cars  income    expense
Beijing    55000.0  300000.0   15000  5800000.0
Chongqing      NaN  150000.0   15000        NaN
Guangzhou  25000.0  200000.0   15000  2700000.0
Hangzhou   20000.0       NaN   15000        NaN
Shanghai   60000.0  400000.0   15000  6400000.0
Shenzhen   50000.0  300000.0   15000  5300000.0
Suzhou         NaN       NaN   15000        NaN
Tianjin        NaN  200000.0   15000        NaN

In [23]:
df.fillna(value=0)

              apts      cars  income    expense
Beijing    55000.0  300000.0   15000  5800000.0
Chongqing      0.0  150000.0   15000        0.0
Guangzhou  25000.0  200000.0   15000  2700000.0
Hangzhou   20000.0       0.0   15000        0.0
Shanghai   60000.0  400000.0   15000  6400000.0
Shenzhen   50000.0  300000.0   15000  5300000.0
Suzhou         0.0       0.0   15000        0.0
Tianjin        0.0  200000.0   15000        0.0

In [24]:
df.fillna(method="ffill")

              apts      cars  income    expense
Beijing    55000.0  300000.0   15000  5800000.0
Chongqing  55000.0  150000.0   15000  5800000.0
Guangzhou  25000.0  200000.0   15000  2700000.0
Hangzhou   20000.0  200000.0   15000  2700000.0
Shanghai   60000.0  400000.0   15000  6400000.0
Shenzhen   50000.0  300000.0   15000  5300000.0
Suzhou     50000.0  300000.0   15000  5300000.0
Tianjin    50000.0  200000.0   15000  5300000.0

In [25]:
df.fillna(method="bfill")

              apts      cars  income    expense
Beijing    55000.0  300000.0   15000  5800000.0
Chongqing  25000.0  150000.0   15000  2700000.0
Guangzhou  25000.0  200000.0   15000  2700000.0
Hangzhou   20000.0  400000.0   15000  6400000.0
Shanghai   60000.0  400000.0   15000  6400000.0
Shenzhen   50000.0  300000.0   15000  5300000.0
Suzhou         NaN  200000.0   15000        NaN
Tianjin        NaN  200000.0   15000        NaN

In [26]:
df.ffill()

              apts      cars  income    expense
Beijing    55000.0  300000.0   15000  5800000.0
Chongqing  55000.0  150000.0   15000  5800000.0
Guangzhou  25000.0  200000.0   15000  2700000.0
Hangzhou   20000.0  200000.0   15000  2700000.0
Shanghai   60000.0  400000.0   15000  6400000.0
Shenzhen   50000.0  300000.0   15000  5300000.0
Suzhou     50000.0  300000.0   15000  5300000.0
Tianjin    50000.0  200000.0   15000  5300000.0

In [27]:
df.bfill()

              apts      cars  income    expense
Beijing    55000.0  300000.0   15000  5800000.0
Chongqing  25000.0  150000.0   15000  2700000.0
Guangzhou  25000.0  200000.0   15000  2700000.0
Hangzhou   20000.0  400000.0   15000  6400000.0
Shanghai   60000.0  400000.0   15000  6400000.0
Shenzhen   50000.0  300000.0   15000  5300000.0
Suzhou         NaN  200000.0   15000        NaN
Tianjin        NaN  200000.0   15000        NaN

In [29]:
row = df.loc["Guangzhou"]
row

apts         25000.0
cars        200000.0
income       15000.0
expense    2700000.0
Name: Guangzhou, dtype: float64

In [30]:
df

              apts      cars  income    expense
Beijing    55000.0  300000.0   15000  5800000.0
Chongqing      NaN  150000.0   15000        NaN
Guangzhou  25000.0  200000.0   15000  2700000.0
Hangzhou   20000.0       NaN   15000        NaN
Shanghai   60000.0  400000.0   15000  6400000.0
Shenzhen   50000.0  300000.0   15000  5300000.0
Suzhou         NaN       NaN   15000        NaN
Tianjin        NaN  200000.0   15000        NaN

In [38]:
df.sub(row, axis=1)

              apts      cars  income    expense
Beijing    30000.0  100000.0     0.0  3100000.0
Chongqing      NaN  -50000.0     0.0        NaN
Guangzhou      0.0       0.0     0.0        0.0
Hangzhou   -5000.0       NaN     0.0        NaN
Shanghai   35000.0  200000.0     0.0  3700000.0
Shenzhen   25000.0  100000.0     0.0  2600000.0
Suzhou         NaN       NaN     0.0        NaN
Tianjin        NaN       0.0     0.0        NaN

In [32]:
col = df["cars"]
col

Beijing      300000.0
Chongqing    150000.0
Guangzhou    200000.0
Hangzhou          NaN
Shanghai     400000.0
Shenzhen     300000.0
Suzhou            NaN
Tianjin      200000.0
Name: cars, dtype: float64

In [37]:
df.sub(col, axis=0)

               apts  cars    income    expense
Beijing   -245000.0   0.0 -285000.0  5500000.0
Chongqing       NaN   0.0 -135000.0        NaN
Guangzhou -175000.0   0.0 -185000.0  2500000.0
Hangzhou        NaN   NaN       NaN        NaN
Shanghai  -340000.0   0.0 -385000.0  6000000.0
Shenzhen  -250000.0   0.0 -285000.0  5000000.0
Suzhou          NaN   NaN       NaN        NaN
Tianjin         NaN   0.0 -185000.0        NaN

### 2017七月在线 机器学习在线集训 julyedu.com

## Index

### index object

In [1]:
import pandas as pd
import numpy as np

自己建一个index object

In [2]:
index = pd.Index(["Shanghai", "Beijing", "Guangzhou", "Shenzhen"])
index

Index(['Shanghai', 'Beijing', 'Guangzhou', 'Shenzhen'], dtype='object')

In [3]:
"Shanghai" in index

True

从Series里面拿出一个index object

In [6]:
obj = pd.Series(range(3), index=["a", "b", "c"])
obj_index = obj.index

In [8]:
obj_index[1:]

Index(['b', 'c'], dtype='object')

index的值是不能被更改的

In [5]:
index[1] = "Hangzhou"

TypeError: Index does not support mutable operations

创建Series时声明index

In [9]:
index

Index(['Shanghai', 'Beijing', 'Guangzhou', 'Shenzhen'], dtype='object')

In [11]:
apts = pd.Series([60000, 50000, 20000, 55000], index=index, name="apts")
apts

Shanghai     60000
Beijing      50000
Guangzhou    20000
Shenzhen     55000
Name: apts, dtype: int64

sex_index

In [12]:
df = pd.DataFrame({"city": ["Beijing", "Beijing", "Shanghai", "Shanghai"],
                  "year": [2016, 2017, 2016, 2017],
                  "label": [0, 1, 2, 3],
                  "population": [2100, 2200, 2300, 2400]})
df

       city  label  population  year
0   Beijing      0        2100  2016
1   Beijing      1        2200  2017
2  Shanghai      2        2300  2016
3  Shanghai      3        2400  2017

In [14]:
df_label = df.set_index("label")
df_label

           city  population  year
label
0       Beijing        2100  2016
1       Beijing        2200  2017
2      Shanghai        2300  2016
3      Shanghai        2400  2017

In [15]:
df.set_index("label", drop=False)

           city  label  population  year
label
0       Beijing      0        2100  2016
1       Beijing      1        2200  2017
2      Shanghai      2        2300  2016
3      Shanghai      3        2400  2017

In [16]:
df.set_index(["city", "year"])

               label  population
city     year
Beijing  2016      0        2100
         2017      1        2200
Shanghai 2016      2        2300
         2017      3        2400

In [18]:
df_label.set_index(["city", "year"])

               population
city     year
Beijing  2016        2100
         2017        2200
Shanghai 2016        2300
         2017        2400

In [21]:
df3 = df_label.set_index(["city", "year"], append=True)
df3

                     population
label city     year
0     Beijing  2016        2100
1     Beijing  2017        2200
2     Shanghai 2016        2300
3     Shanghai 2017        2400

In [22]:
df3.reset_index()

   label      city  year  population
0      0   Beijing  2016        2100
1      1   Beijing  2017        2200
2      2  Shanghai  2016        2300
3      3  Shanghai  2017        2400

In [24]:
df3.reset_index(level=1)

                city  population
label year
0     2016   Beijing        2100
1     2017   Beijing        2200
2     2016  Shanghai        2300
3     2017  Shanghai        2400

In [25]:
df3.reset_index(level=[1,2])

           city  year  population
label
0       Beijing  2016        2100
1       Beijing  2017        2200
2      Shanghai  2016        2300
3      Shanghai  2017        2400

In [26]:
df3.index

MultiIndex(levels=[[0, 1, 2, 3], ['Beijing', 'Shanghai'], [2016, 2017]],
           labels=[[0, 1, 2, 3], [0, 0, 1, 1], [0, 1, 0, 1]],
           names=['label', 'city', 'year'])

### 针对index进行索引和切片

In [27]:
s = pd.Series(np.arange(4), index=["a", "b", 'c', 'd'])
s

a    0
b    1
c    2
d    3
dtype: int64

In [28]:
s['b']

1

默认的数字index依旧可以使用

In [30]:
s[2]

2

In [31]:
s[[2,1]]

c    2
b    1
dtype: int64

下面是如何对Series进行切片

In [32]:
s['b':'c']

b    1
c    2
dtype: int64

对DataFrame进行Indexing与Series基本相同

In [34]:
df = pd.DataFrame(np.arange(9).reshape(3,3), 
                 index = ['a', 'b', 'c'],
                 columns = ['x', 'y', 'z'])
df.index

Index(['a', 'b', 'c'], dtype='object')

In [35]:
df.columns

Index(['x', 'y', 'z'], dtype='object')

In [40]:
df.T

   a  b  c
x  0  3  6
y  1  4  7
z  2  5  8

In [41]:
df

   x  y  z
a  0  1  2
b  3  4  5
c  6  7  8

In [42]:
df[["x", "z"]]

   x  z
a  0  2
b  3  5
c  6  8

In [47]:
df.loc["a":"b", "x":"y"]

   x  y
a  0  1
b  3  4

DataFrame也可以用condition selection

In [50]:
df[df.x < 5]

   x  y  z
a  0  1  2
b  3  4  5

In [52]:
df[df<5] = 0
df

   x  y  z
a  0  0  0
b  0  0  5
c  6  7  8

### [reindex](http://pandas.pydata.org/pandas-docs/stable/generated/pandas.DataFrame.reindex.html)

把一个Series或者DataFrame按照新的index顺序进行重排

In [53]:
s = pd.Series([4.5, 2.7, 8.9, -0.4], index = ['d', 'b', 'a', 'c'])
s

d    4.5
b    2.7
a    8.9
c   -0.4
dtype: float64

In [55]:
s.reindex(['a', 'b', 'c', 'd', 'e'])

a    8.9
b    2.7
c   -0.4
d    4.5
e    NaN
dtype: float64

In [56]:
s = pd.Series(['blue', 'red', 'yellow'], index=[0,2,4])
s

0      blue
2       red
4    yellow
dtype: object

In [59]:
s.reindex(range(6), method="ffill")

0      blue
1      blue
2       red
3       red
4    yellow
5    yellow
dtype: object

In [60]:
s.reindex(range(6), method="bfill")

0      blue
1       red
2       red
3    yellow
4    yellow
5       NaN
dtype: object

既然我们可以对Series进行reindex，相应地，我们也可以用同样的方法对DataFrame进行reindex。

In [64]:
df = pd.DataFrame(np.arange(9).reshape(3,3), 
                 index = ['b', 'a', 'd'],
                 columns = ['y', 'z', 'x'])
df

   y  z  x
b  0  1  2
a  3  4  5
d  6  7  8

In [63]:
df = df.reindex(['a', 'b', 'c', 'd'])
df

     x    y    z
a  3.0  4.0  5.0
b  0.0  1.0  2.0
c  NaN  NaN  NaN
d  6.0  7.0  8.0

In [66]:
df = df.reindex(['a', 'b', 'c', 'd'], columns = ['x', 'y', 'z'])
df

     x    y    z
a  5.0  3.0  4.0
b  2.0  0.0  1.0
c  NaN  NaN  NaN
d  8.0  6.0  7.0

在reindex的同时，我们还可以重新指定columns

下面介绍如何用drop来删除Series和DataFrame中的index

In [68]:
df2 = df.drop("b")
df2

     x    y    z
a  5.0  3.0  4.0
c  NaN  NaN  NaN
d  8.0  6.0  7.0

In [69]:
df.drop(["a", "c"])

     x    y    z
b  2.0  0.0  1.0
d  8.0  6.0  7.0

In [72]:
df.drop(["y", "x"], axis=1)

     z
a  4.0
b  1.0
c  NaN
d  7.0

drop不仅仅可以删除行，还可以删除列

In [73]:
df

     x    y    z
a  5.0  3.0  4.0
b  2.0  0.0  1.0
c  NaN  NaN  NaN
d  8.0  6.0  7.0

### hierarchical index

Series的hierarchical indexing

In [74]:
data = pd.Series(np.random.randn(10), index = [["a", 'a', 'a', 'b', 'b', 'c', 'c', 'd', 'd', 'd'],\
                                               [1,2,3,1,2,1,2,1,2,3]])
data

a  1    0.749063
   2   -1.377602
   3   -0.243244
b  1    0.807103
   2   -0.817357
c  1   -0.177958
   2    1.181911
d  1    0.485940
   2    1.860314
   3    0.545842
dtype: float64

In [75]:
data.index

MultiIndex(levels=[['a', 'b', 'c', 'd'], [1, 2, 3]],
           labels=[[0, 0, 0, 1, 1, 2, 2, 3, 3, 3], [0, 1, 2, 0, 1, 0, 1, 0, 1, 2]])

In [78]:
type(data)

pandas.core.series.Series

In [80]:
data["b": "c"]

b  1    0.807103
   2   -0.817357
c  1   -0.177958
   2    1.181911
dtype: float64

In [81]:
data[:2]

a  1    0.749063
   2   -1.377602
dtype: float64

unstack和stack可以帮助我们在hierarchical indexing和DataFrame之间进行切换。

In [86]:
unstacked = data.unstack()
unstacked

          1         2         3
a  0.749063 -1.377602 -0.243244
b  0.807103 -0.817357       NaN
c -0.177958  1.181911       NaN
d  0.485940  1.860314  0.545842

In [83]:
type(data.unstack())

pandas.core.frame.DataFrame

In [87]:
unstacked.stack()

a  1    0.749063
   2   -1.377602
   3   -0.243244
b  1    0.807103
   2   -0.817357
c  1   -0.177958
   2    1.181911
d  1    0.485940
   2    1.860314
   3    0.545842
dtype: float64

In [89]:
df.stack()

a  x    5.0
   y    3.0
   z    4.0
b  x    2.0
   y    0.0
   z    1.0
d  x    8.0
   y    6.0
   z    7.0
dtype: float64

DataFrame的hierarchical indexing

In [91]:
df = pd.DataFrame(np.arange(12).reshape(4,3),
                    index = [["a", "a", 'b', 'b'], [1,2,1,2]],
                    columns = [["x", "y", "y"], [1,1,2]])
df

     x   y
     1   1   2
a 1  0   1   2
  2  3   4   5
b 1  6   7   8
  2  9  10  11

In [92]:
df.index.names = ["key1", "key2"]
df.columns.names = ["column1", "column2"]
df

column1    x   y
column2    1   1   2
key1 key2
a    1     0   1   2
     2     3   4   5
b    1     6   7   8
     2     9  10  11

In [98]:
df.loc['a'].loc[1]["x"][1]

0

## csv文件读写

- [read_csv](https://pandas.pydata.org/pandas-docs/stable/generated/pandas.read_csv.html)
- [to_csv](https://pandas.pydata.org/pandas-docs/stable/generated/pandas.DataFrame.to_csv.html)

In [105]:
goog = pd.read_csv("data/GOOG.csv", index_col=0)
# goog

In [104]:
# goog = goog.set_index("Date")

In [106]:
goog = goog.reindex(pd.to_datetime(goog.index))
goog

,Open,High,Low,Close,Adj Close,Volume
Date,,,,,,
2004-08-19,49.813286,51.835709,47.800831,49.982655,49.982655,44871300
2004-08-20,50.316402,54.336334,50.062355,53.952770,53.952770,22942800
2004-08-23,55.168217,56.528118,54.321388,54.495735,54.495735,18342800
2004-08-24,55.412300,55.591629,51.591621,52.239193,52.239193,15319700
2004-08-25,52.284027,53.798351,51.746044,52.802086,52.802086,9232100
2004-08-26,52.279045,53.773445,52.134586,53.753517,53.753517,7128600
2004-08-27,53.848164,54.107193,52.647663,52.876804,52.876804,6241200
2004-08-30,52.443428,52.548038,50.814533,50.814533,50.814533,5221400
2004-08-31,50.958992,51.661362,50.889256,50.993862,50.993862,4941200
2004-09-01,51.158245,51.292744,49.648903,49.937820,49.937820,9181600
2004-09-02,49.409801,50.993862,49.285267,50.565468,50.565468,15190400
2004-09-03,50.286514,50.680038,49.474556,49.818268,49.818268,5176800
2004-09-07,50.316402,50.809555,49.619015,50.600338,50.600338,5875200
2004-09-08,50.181908,51.322632,50.062355,50.958992,50.958992,5009200
2004-09-09,51.073563,51.163227,50.311420,50.963974,50.963974,4080900
2004-09-10,50.610302,53.081039,50.460861,52.468334,52.468334,8740200
2004-09-13,53.115910,54.002586,53.031227,53.549286,53.549286,7881300
2004-09-14,53.524376,55.790882,53.195610,55.536835,55.536835,10880300
2004-09-15,55.073570,56.901718,54.894241,55.790882,55.790882,10763900
2004-09-16,55.960247,57.683788,55.616535,56.772205,56.772205,9310200
2004-09-17,56.996365,58.525631,56.562988,58.525631,58.525631,9517400
2004-09-20,58.256641,60.572956,58.166977,59.457142,59.457142,10679200
2004-09-21,59.681301,59.985161,58.535595,58.699978,58.699978,7263000
2004-09-22,58.480801,59.611561,58.186901,58.968971,58.968971,7617100
2004-09-23,59.198112,61.086033,58.291508,60.184414,60.184414,8576100
2004-09-24,60.244190,61.818291,59.656395,59.691261,59.691261,9166700
2004-09-27,59.556767,60.214302,58.680054,58.909195,58.909195,7099600
2004-09-28,60.423519,63.462128,59.880554,63.193138,63.193138,17009400
2004-09-29,63.113434,67.257904,62.879314,65.295258,65.295258,30661400
2004-09-30,64.707458,65.902977,64.259140,64.558022,64.558022,13823300
...,...,...,...,...,...,...
2017-06-08,982.349976,984.570007,977.200012,983.409973,983.409973,1481900
2017-06-09,984.500000,984.500000,935.630005,949.830017,949.830017,3309400
2017-06-12,939.559998,949.354980,915.232971,942.900024,942.900024,3763500
2017-06-13,951.909973,959.979980,944.090027,953.400024,953.400024,2013300
2017-06-14,959.919983,961.150024,942.250000,950.760010,950.760010,1489700
2017-06-15,933.969971,943.338989,924.440002,942.309998,942.309998,2133100
2017-06-16,940.000000,942.039978,931.594971,939.780029,939.780029,3094700
2017-06-19,949.960022,959.989990,949.049988,957.369995,957.369995,1533300
2017-06-20,957.520020,961.619995,950.010010,950.630005,950.630005,1126000
2017-06-21,953.640015,960.099976,950.760010,959.450012,959.450012,1202200
2017-06-22,958.700012,960.719971,954.549988,957.090027,957.090027,941400
2017-06-23,956.830017,966.000000,954.200012,965.590027,965.590027,1527900
2017-06-26,969.900024,973.309998,950.789978,952.270020,952.270020,1598400
2017-06-27,942.460022,948.289978,926.849976,927.330017,927.330017,2579900
2017-06-28,929.000000,942.750000,916.000000,940.489990,940.489990,2721400
2017-06-29,929.919983,931.260010,910.619995,917.789978,917.789978,3299200
2017-06-30,926.049988,926.049988,908.309998,908.729980,908.729980,2065500
2017-07-03,912.179993,913.940002,894.789978,898.700012,898.700012,1709800
2017-07-05,901.760010,914.510010,898.500000,911.710022,911.710022,1813900
2017-07-06,904.119995,914.943970,899.700012,906.690002,906.690002,1424500
2017-07-07,908.849976,921.539978,908.849976,918.590027,918.590027,1637800
2017-07-10,921.770020,930.380005,919.590027,928.799988,928.799988,1192800
2017-07-11,929.539978,931.429993,922.000000,930.090027,930.090027,1113200
2017-07-12,938.679993,946.299988,934.469971,943.830017,943.830017,1532100
2017-07-13,946.289978,954.450012,943.010010,947.159973,947.159973,1294700
2017-07-14,952.000000,956.909973,948.005005,955.989990,955.989990,1053800
2017-07-17,957.000000,960.739990,949.241028,953.419983,953.419983,1165500
2017-07-18,953.000000,968.039978,950.599976,965.400024,965.400024,1154000
2017-07-19,967.840027,973.039978,964.030029,970.890015,970.890015,1224500
2017-07-20,975.000000,975.900024,961.510010,968.150024,968.150024,1616500

In [107]:
goog.head()

                 Open       High        Low      Close  Adj Close    Volume
Date
2004-08-19  49.813286  51.835709  47.800831  49.982655  49.982655  44871300
2004-08-20  50.316402  54.336334  50.062355  53.952770  53.952770  22942800
2004-08-23  55.168217  56.528118  54.321388  54.495735  54.495735  18342800
2004-08-24  55.412300  55.591629  51.591621  52.239193  52.239193  15319700
2004-08-25  52.284027  53.798351  51.746044  52.802086  52.802086   9232100

In [108]:
goog.tail()

,Open,High,Low,Close,Adj Close,Volume
Date,,,,,,
2017-07-14,952.000000,956.909973,948.005005,955.989990,955.989990,1053800
2017-07-17,957.000000,960.739990,949.241028,953.419983,953.419983,1165500
2017-07-18,953.000000,968.039978,950.599976,965.400024,965.400024,1154000
2017-07-19,967.840027,973.039978,964.030029,970.890015,970.890015,1224500
2017-07-20,975.000000,975.900024,961.510010,968.150024,968.150024,1616500

In [111]:
df.to_csv("data/sample.tsv", sep="\t")

## 课后练习
download stock data from yahoo finance, and use read_csv to create dataframe, and play with the dataframe.